HCHCHC99/WS/ws_v.1.1/HC32F460_DDL_Rev3.3.0/projects/ev_hc32f460_lqfp100_v2/.tmp/main_utf8.c

  #include "main.h"
  #include "Hardware.h"
  #include "rtt_log.h"
  #include "timer6_timebase.h"
  #include "Motor_hall.h"
  #include "TickTimer.h"
  #include "device_manager.h"
  #include "App_Motor_Project.h"
  #include "param_manager.h"
  #include "Gpio_io.h"
  #include "App_Comm.h"
  #include "Params.h"
  #include "App_FaultHandler.h"
  #include "rtt_manager.h"
  #include "Pwm.h"
  #include "hc32_ll_utility.h"
  #include "tmr4_pwm.h"
#include "dev_commutation.h"

//   /*=============================================================================
//    * 全锟斤拷PWM实锟斤拷锟斤拷锟斤拷锟斤拷锟斤拷锟斤拷锟绞癸拷茫锟?????
//    *=============================================================================*/
  pwm_t g_motor_pwm_ch1;  // PB6
  pwm_t g_motor_pwm_ch2;  // PB7
  pwm_t g_motor_pwm_ch3;  // PB8
  pwm_t g_motor_pwm_ch4;  // PB9

//   /*=============================================================================
//    * 锟斤拷锟斤拷锟斤拷锟斤拷
//    *=============================================================================*/
//   static void Motor_Pwm_Init(void);

//   /*=============================================================================
//    * 锟斤拷始锟斤拷锟斤拷锟斤拷锟斤拷锟斤拷玫锟絇WM锟斤拷4锟斤拷通锟斤拷锟斤拷全锟斤拷锟斤拷锟斤拷效锟斤拷
//    *=============================================================================*/
//   static void Motor_Pwm_Init(void)
//   {
//       // 锟斤拷锟斤拷锟斤拷锟斤拷锟斤拷?4锟斤拷通锟斤拷全锟斤拷锟斤拷锟斤拷效锟斤拷锟斤拷锟斤拷转通锟斤拷占锟秸比凤拷锟斤拷实锟街ｏ拷
//       // 频锟绞ｏ拷20kHz锟斤拷锟斤拷始占锟秸比ｏ拷0%

//       // 锟斤拷锟斤拷GPIO锟斤拷锟借（锟斤拷锟斤拷锟睫革拷GPIO锟斤拷锟斤拷锟斤拷锟矫ｏ拷
//       LL_PERIPH_WE(LL_PERIPH_GPIO);

//       // CH1: PB6 - 锟斤拷锟斤拷效
//       g_motor_pwm_ch1 = PWM_Init(CM_TMRA_4, FCG2_PERIPH_TMRA_4, TMRA_CH1,
//                                   GPIO_PORT_B, GPIO_PIN_06, GPIO_FUNC_4,
//                                   TMRA_MD_SAWTOOTH, TMRA_DIR_UP,
//                                   6000, 0, PWM_ACTIVE_LOW);

//       // CH2: PB7 - 锟斤拷锟斤拷效
//       g_motor_pwm_ch2 = PWM_Init(CM_TMRA_4, FCG2_PERIPH_TMRA_4, TMRA_CH2,
//                                   GPIO_PORT_B, GPIO_PIN_07, GPIO_FUNC_4,
//                                   TMRA_MD_SAWTOOTH, TMRA_DIR_UP,
//                                   6000, 0, PWM_ACTIVE_LOW);

//       // CH3: PB8 - 锟斤拷锟斤拷效
//       g_motor_pwm_ch3 = PWM_Init(CM_TMRA_4, FCG2_PERIPH_TMRA_4, TMRA_CH3,
//                                   GPIO_PORT_B, GPIO_PIN_08, GPIO_FUNC_4,
//                                   TMRA_MD_SAWTOOTH, TMRA_DIR_UP,
//                                   6000, 0, PWM_ACTIVE_LOW);

//       // CH4: PB9 - 锟斤拷锟斤拷效
//       g_motor_pwm_ch4 = PWM_Init(CM_TMRA_4, FCG2_PERIPH_TMRA_4, TMRA_CH4,
//                                   GPIO_PORT_B, GPIO_PIN_09, GPIO_FUNC_4,
//                                   TMRA_MD_SAWTOOTH, TMRA_DIR_UP,
//                                   6000, 0, PWM_ACTIVE_LOW);

//       // 锟斤拷锟斤拷GPIO锟斤拷锟借（锟斤拷锟斤拷锟斤拷煤锟斤拷锟斤拷锟斤拷锟?????
//       LL_PERIPH_WP(LL_PERIPH_GPIO);

//       // 锟斤拷锟斤拷FCG锟斤拷锟借（使锟杰讹拷时锟斤拷时锟接ｏ拷
//       LL_PERIPH_WE(LL_PERIPH_FCG);

//       // 锟斤拷锟斤拷锟斤拷锟斤拷PWM锟斤拷时锟斤拷
//       PWM_Start(&g_motor_pwm_ch1);
//       PWM_Start(&g_motor_pwm_ch2);
//       PWM_Start(&g_motor_pwm_ch3);
//       PWM_Start(&g_motor_pwm_ch4);

//       // 使锟斤拷锟斤拷锟?????
//       PWM_OutputCmd(&g_motor_pwm_ch1, PWM_OUTPUT_ENABLE);
//       PWM_OutputCmd(&g_motor_pwm_ch2, PWM_OUTPUT_ENABLE);
//       PWM_OutputCmd(&g_motor_pwm_ch3, PWM_OUTPUT_ENABLE);
//       PWM_OutputCmd(&g_motor_pwm_ch4, PWM_OUTPUT_ENABLE);

//       // 锟斤拷锟斤拷FCG锟斤拷锟斤拷
//       LL_PERIPH_WP(LL_PERIPH_FCG);

//       MAIN_D("Motor PWM initialized: 4 channels, 20kHz, low active\r\n");
//   }

  /*=============================================================================
   * 锟斤拷锟斤拷锟斤拷
   *=============================================================================*/
  volatile int commu_num = 0;
  volatile int comm_mode = 0;   /* 0=停, 1=正转, 2=反转 */
  static int s_prev_mode = 0;
  static uint64_t s_last_step_time_us = 0;
  #define COMM_STEP_INTERVAL_US  5000UL   /* 5ms per step -> ~667 RPM (3 pole pairs) */
  #define COMM_PWM_FREQ_HZ       50000UL
  #define COMM_DUTY_PCT          20.0f
  int main(void)
  {
      Hardware_Init();

      /* 通锟斤拷栈锟斤拷始锟斤拷 (RS485 + Modbus RTU) */
      static const App_Comm_Config_t comm_cfg = {
          .phy.baudrate     = 9600,
          .phy.dir_polarity = 0,
          .hal.rx_buf_size  = 500,
          .hal.tx_buf_size  = 500,
          .hal.rx_frame_queue_depth = 10,
          .hal.tx_queue_depth       = 10,
          .hal.frame_timeout_ms     = 0,
          .proto.node_id            = 1,
          .proto.enable_write_multi = true,
      };
      App_Comm_Init(&comm_cfg);

    //   ESystem_Init();

      /* 锟斤拷始锟斤拷锟斤拷锟较达拷锟斤拷锟斤拷锟斤拷锟斤拷锟侥碉拷压/锟斤拷锟斤拷锟铰硷拷锟斤拷锟斤拷锟铰癸拷锟斤拷锟诫） */
    //   FaultHandler_Init();

      /* 锟斤拷始锟斤拷锟斤拷锟絇WM锟斤拷锟节碉拷锟斤拷璞革拷锟绞硷拷锟斤拷前锟斤拷? */
    //   Motor_Pwm_Init();
      tickTimer_DelayMs(5);
      static const tmr4_pwm_config_t pwm_cfg = {
          .output_type_u = TMR4_OUTPUT_SYNC,
          .output_type_v = TMR4_OUTPUT_SYNC,
          .output_type_w = TMR4_OUTPUT_SYNC,
          .freq_hz       = 50000,
          .dead_time_ns  = 0,
          .active_high   = true,
      };
      TMR4_PWM_Config(&pwm_cfg);

      MAIN_D("[MAIN] TMR4 Config done, starting output");
      TMR4_PWM_StartOutput();

      /* 初始化定时器, 用于换相计时 */
      Timer6_Timebase_Init();
      Timer6_Timebase_Start();

      /* 六步换相: 上电默认滑行态 (三相98% SYNC -> 上管全通 -> 同电位 -> 自由滑行) */
      int ch;
      for (ch = 0; ch < 3; ch++) {
          TMR4_PWM_SetChannelMode((tmr4_pwm_channel_t)ch, TMR4_MODE_SYNC, 98.0f);
      }
      s_prev_mode = 0;

      EventBus_Enable();

      while (1) {
          App_Comm_Poll();

          /* 模式切换检测 */
          if (comm_mode != s_prev_mode) {
              s_prev_mode = comm_mode;

              if (comm_mode == 0) {
                  /* 滑行: 三相全设为98% SYNC -> H=L -> H=HIGH/L=HIGH 上管全通 -> 三相同电位 -> 自由滑行 */
                  int ch;
                  for (ch = 0; ch < 3; ch++) {
                      TMR4_PWM_SetChannelMode((tmr4_pwm_channel_t)ch, TMR4_MODE_SYNC, 98.0f);
                  }
                  MAIN_D("[COMM] Mode=0: COAST");
              } else {
                  /* 启动: 复位到 step0, 记录起始时间 */
                  commu_num = 0;
                  Commutation_Init();
                  COMM_STEP_UH_VL(COMM_PWM_FREQ_HZ, COMM_DUTY_PCT);
                  s_last_step_time_us = Timer6_Timebase_GetTimestamp();
                  MAIN_D("[COMM] Mode=%d: START, step=0", comm_mode);
              }
          }

          /* 运行状态: 定时步进 */
          if (comm_mode != 0) {
              Timer6_Timebase_UpdateTimestamp();
              uint64_t now = Timer6_Timebase_GetTimestamp();

              if ((now - s_last_step_time_us) >= COMM_STEP_INTERVAL_US) {
                  s_last_step_time_us = now;

                  if (comm_mode == 1) {
                      /* 正转: step +1 */
                      commu_num = (commu_num + 1) % 6;
                  } else {
                      /* 反转: step -1 (等价于 +5 mod 6) */
                      commu_num = (commu_num + 5) % 6;
                  }
                  Commutation_Step((uint8_t)commu_num, COMM_PWM_FREQ_HZ, COMM_DUTY_PCT);
              }
          }
      }
  }
